#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/jason-riddle/infrastructure/runs/run-LmsqMUPwXTfNqWDD

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
data.cloudflare_zone.jasonriddle_com: Refreshing...
data.cloudflare_zone.jrapps_org: Refreshing...
data.cloudflare_zone.jrapps_org: Refresh complete after 0s [id=e524213b9f8f46634edaa538c5eec600]
cloudflare_record.jrapps_org_nx15310_your_storageshare_de: Refreshing state... [id=7fe05082aef1ad2252b3cc52856e212b]
data.cloudflare_zone.jasonriddle_com: Refresh complete after 1s [id=9f93875a5fa04d2c57407aac00a18ce9]
cloudflare_record.www_jasonriddle_com: Refreshing state... [id=92c6b42bf0b0420c52363af0eca0129f]
cloudflare_record.jasonriddle_com_10_in2-smtp_messagingengine_com: Refreshing state... [id=38bbf11d7500217ca59728f68db4b0ed]
cloudflare_record.jasonriddle_com_10_in1-smtp_messagingengine_com: Refreshing state... [id=666c04d7cd719b2432584386ea971e41]
cloudflare_record.wildcard_jasonriddle_com_10_in1-smtp_messagingengine_com: Refreshing state... [id=54f1bcf413637109fd3c9b67f87ee60b]
cloudflare_record.google_site_verification: Refreshing state... [id=01ffe0bccf07592d97eaffba279a7387]
cloudflare_record.jasonriddle_com: Refreshing state... [id=feb571b6a04f186e505ac613e6559915]
cloudflare_record.newsletter_jasonriddle_com: Refreshing state... [id=9b41d19907274c98e474f24c1530f54c]
cloudflare_record.wildcard_jasonriddle_com_20_in1-smtp_messagingengine_com: Refreshing state... [id=42ed4ab7c6c59fff83056205728815a4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.infrastructure[0] will be created
  + resource "github_repository" "infrastructure" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "infrastructure"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>
*Pushed by: @jason-riddle, Action: `pull_request`*